---
kind: enumMember
id: F:Autodesk.Revit.DB.ExternallyTaggedNonBRepUsage.Referenceable
enum: Autodesk.Revit.DB.ExternallyTaggedNonBRepUsage
source: html/e1c38aeb-52d1-69cc-8601-3f9c2637b4da.htm
---
# Autodesk.Revit.DB.ExternallyTaggedNonBRepUsage.Referenceable

Can be dimensioned to as well as snapped to.